---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireSet.#ctor
source: html/35d68415-dcdc-9cc2-29f9-f0939125e206.htm
---
# Autodesk.Revit.DB.Electrical.WireSet.#ctor Method

Initializes a new instance of the WireSet class

## Syntax (C#)
```csharp
public WireSet()
```